sfxfs/PIC-Class/pic_for_vscode/include/pic16f91x.h
/* Definitions for TXSTA register */
volatile       bit	TX9D		@ ((unsigned)&TXSTA*8)+0;
volatile       bit	TRMT		@ ((unsigned)&TXSTA*8)+1;
               bit	BRGH		@ ((unsigned)&TXSTA*8)+2;
               bit	SYNC		@ ((unsigned)&TXSTA*8)+4;
               bit	TXEN		@ ((unsigned)&TXSTA*8)+5;
               bit	TX9		@ ((unsigned)&TXSTA*8)+6;
               bit	CSRC		@ ((unsigned)&TXSTA*8)+7;

/* Definitions for CMCON0 register */
               bit	CM0		@ ((unsigned)&CMCON0*8)+0;
               bit	CM1		@ ((unsigned)&CMCON0*8)+1;
               bit	CM2		@ ((unsigned)&CMCON0*8)+2;
               bit	CIS		@ ((unsigned)&CMCON0*8)+3;
               bit	C1INV		@ ((unsigned)&CMCON0*8)+4;
               bit	C2INV		@ ((unsigned)&CMCON0*8)+5;
volatile       bit	C1OUT		@ ((unsigned)&CMCON0*8)+6;
volatile       bit	C2OUT		@ ((unsigned)&CMCON0*8)+7;

/* Definitions for VRCON register */
               bit	VR0		@ ((unsigned)&VRCON*8)+0;
               bit	VR1		@ ((unsigned)&VRCON*8)+1;
               bit	VR2		@ ((unsigned)&VRCON*8)+2;
               bit	VR3		@ ((unsigned)&VRCON*8)+3;
               bit	VRR		@ ((unsigned)&VRCON*8)+5;
               bit	VREN		@ ((unsigned)&VRCON*8)+7;

/* Definitions for ADCON1 register */
               bit	ADCS0		@ ((unsigned)&ADCON1*8)+4;
               bit	ADCS1		@ ((unsigned)&ADCON1*8)+5;
               bit	ADCS2		@ ((unsigned)&ADCON1*8)+6;

/* Definitions for WDTCON register */
               bit	SWDTEN		@ ((unsigned)&WDTCON*8)+0;
               bit	WDTPS0		@ ((unsigned)&WDTCON*8)+1;
               bit	WDTPS1		@ ((unsigned)&WDTCON*8)+2;
               bit	WDTPS2		@ ((unsigned)&WDTCON*8)+3;
               bit	WDTPS3		@ ((unsigned)&WDTCON*8)+4;

/* Definitions for LCDCON register */
               bit	LMUX0		@ ((unsigned)&LCDCON*8)+0;
               bit	LMUX1		@ ((unsigned)&LCDCON*8)+1;
               bit	CS0		@ ((unsigned)&LCDCON*8)+2;
               bit	CS1		@ ((unsigned)&LCDCON*8)+3;
               bit	VLCDEN		@ ((unsigned)&LCDCON*8)+4;
volatile       bit	WERR		@ ((unsigned)&LCDCON*8)+5;
               bit	SLPEN		@ ((unsigned)&LCDCON*8)+6;
               bit	LCDEN		@ ((unsigned)&LCDCON*8)+7;

/* Definitions for LCDPS register */
               bit	LP0		@ ((unsigned)&LCDPS*8)+0;
               bit	LP1		@ ((unsigned)&LCDPS*8)+1;
               bit	LP2		@ ((unsigned)&LCDPS*8)+2;
               bit	LP3		@ ((unsigned)&LCDPS*8)+3;
volatile       bit	WA		@ ((unsigned)&LCDPS*8)+4;
volatile       bit	LCDA		@ ((unsigned)&LCDPS*8)+5;
               bit	BIASMD		@ ((unsigned)&LCDPS*8)+6;
               bit	WFT		@ ((unsigned)&LCDPS*8)+7;

/* Definitions for LVDCON register */
               bit	LVDL0		@ ((unsigned)&LVDCON*8)+0;
               bit	LVDL1		@ ((unsigned)&LVDCON*8)+1;
               bit	LVDL2		@ ((unsigned)&LVDCON*8)+2;
               bit	LVDEN		@ ((unsigned)&LVDCON*8)+4;
volatile       bit	IRVST		@ ((unsigned)&LVDCON*8)+5;

/* Definitions for LCDDATA0 register */
               bit	SEG0COM0	@ ((unsigned)&LCDDATA0*8)+0;
               bit	SEG1COM0	@ ((unsigned)&LCDDATA0*8)+1;
               bit	SEG2COM0	@ ((unsigned)&LCDDATA0*8)+2;
               bit	SEG3COM0	@ ((unsigned)&LCDDATA0*8)+3;
               bit	SEG4COM0	@ ((unsigned)&LCDDATA0*8)+4;
               bit	SEG5COM0	@ ((unsigned)&LCDDATA0*8)+5;
               bit	SEG6COM0	@ ((unsigned)&LCDDATA0*8)+6;
               bit	SEG7COM0	@ ((unsigned)&LCDDATA0*8)+7;

/* Definitions for LCDDATA1 register */
               bit	SEG8COM0	@ ((unsigned)&LCDDATA1*8)+0;
               bit	SEG9COM0	@ ((unsigned)&LCDDATA1*8)+1;
               bit	SEG10COM0	@ ((unsigned)&LCDDATA1*8)+2;
               bit	SEG11COM0	@ ((unsigned)&LCDDATA1*8)+3;
               bit	SEG12COM0	@ ((unsigned)&LCDDATA1*8)+4;
               bit	SEG13COM0	@ ((unsigned)&LCDDATA1*8)+5;
               bit	SEG14COM0	@ ((unsigned)&LCDDATA1*8)+6;
               bit	SEG15COM0	@ ((unsigned)&LCDDATA1*8)+7;

#if defined(_16F914) || defined(_16F917)
/* Definitions for LCDDATA2 register */
               bit	SEG16COM0	@ ((unsigned)&LCDDATA2*8)+0;
               bit	SEG17COM0	@ ((unsigned)&LCDDATA2*8)+1;
               bit	SEG18COM0	@ ((unsigned)&LCDDATA2*8)+2;
               bit	SEG19COM0	@ ((unsigned)&LCDDATA2*8)+3;
               bit	SEG20COM0	@ ((unsigned)&LCDDATA2*8)+4;
               bit	SEG21COM0	@ ((unsigned)&LCDDATA2*8)+5;
               bit	SEG22COM0	@ ((unsigned)&LCDDATA2*8)+6;
               bit	SEG23COM0	@ ((unsigned)&LCDDATA2*8)+7;
#endif

/* Definitions for LCDDATA3 register */
               bit	SEG0COM1	@ ((unsigned)&LCDDATA3*8)+0;
               bit	SEG1COM1	@ ((unsigned)&LCDDATA3*8)+1;
               bit	SEG2COM1	@ ((unsigned)&LCDDATA3*8)+2;
               bit	SEG3COM1	@ ((unsigned)&LCDDATA3*8)+3;
               bit	SEG4COM1	@ ((unsigned)&LCDDATA3*8)+4;
               bit	SEG5COM1	@ ((unsigned)&LCDDATA3*8)+5;
               bit	SEG6COM1	@ ((unsigned)&LCDDATA3*8)+6;
               bit	SEG7COM1	@ ((unsigned)&LCDDATA3*8)+7;

/* Definitions for LCDDATA4 register */
               bit	SEG8COM1	@ ((unsigned)&LCDDATA4*8)+0;
               bit	SEG9COM1	@ ((unsigned)&LCDDATA4*8)+1;
               bit	SEG10COM1	@ ((unsigned)&LCDDATA4*8)+2;
               bit	SEG11COM1	@ ((unsigned)&LCDDATA4*8)+3;
               bit	SEG12COM1	@ ((unsigned)&LCDDATA4*8)+4;
               bit	SEG13COM1	@ ((unsigned)&LCDDATA4*8)+5;
               bit	SEG14COM1	@ ((unsigned)&LCDDATA4*8)+6;
               bit	SEG15COM1	@ ((unsigned)&LCDDATA4*8)+7;

#if defined(_16F914) || defined(_16F917)
/* Definitions for LCDDATA5 register */
               bit	SEG16COM1	@ ((unsigned)&LCDDATA5*8)+0;
               bit	SEG17COM1	@ ((unsigned)&LCDDATA5*8)+1;
               bit	SEG18COM1	@ ((unsigned)&LCDDATA5*8)+2;
               bit	SEG19COM1	@ ((unsigned)&LCDDATA5*8)+3;
               bit	SEG20COM1	@ ((unsigned)&LCDDATA5*8)+4;
               bit	SEG21COM1	@ ((unsigned)&LCDDATA5*8)+5;
               bit	SEG22COM1	@ ((unsigned)&LCDDATA5*8)+6;
               bit	SEG23COM1	@ ((unsigned)&LCDDATA5*8)+7;
#endif

