sfxfs/PIC-Class/pic_for_vscode/include/pic16f91x.h
/* Definitions for LCDDATA6 register */
               bit	SEG0COM2	@ ((unsigned)&LCDDATA6*8)+0;
               bit	SEG1COM2	@ ((unsigned)&LCDDATA6*8)+1;
               bit	SEG2COM2	@ ((unsigned)&LCDDATA6*8)+2;
               bit	SEG3COM2	@ ((unsigned)&LCDDATA6*8)+3;
               bit	SEG4COM2	@ ((unsigned)&LCDDATA6*8)+4;
               bit	SEG5COM2	@ ((unsigned)&LCDDATA6*8)+5;
               bit	SEG6COM2	@ ((unsigned)&LCDDATA6*8)+6;
               bit	SEG7COM2	@ ((unsigned)&LCDDATA6*8)+7;

/* Definitions for LCDDATA7 register */
               bit	SEG8COM2	@ ((unsigned)&LCDDATA7*8)+0;
               bit	SEG9COM2	@ ((unsigned)&LCDDATA7*8)+1;
               bit	SEG10COM2	@ ((unsigned)&LCDDATA7*8)+2;
               bit	SEG11COM2	@ ((unsigned)&LCDDATA7*8)+3;
               bit	SEG12COM2	@ ((unsigned)&LCDDATA7*8)+4;
               bit	SEG13COM2	@ ((unsigned)&LCDDATA7*8)+5;
               bit	SEG14COM2	@ ((unsigned)&LCDDATA7*8)+6;
               bit	SEG15COM2	@ ((unsigned)&LCDDATA7*8)+7;

#if defined(_16F914) || defined(_16F917)
/* Definitions for LCDDATA8 register */
               bit	SEG16COM2	@ ((unsigned)&LCDDATA8*8)+0;
               bit	SEG17COM2	@ ((unsigned)&LCDDATA8*8)+1;
               bit	SEG18COM2	@ ((unsigned)&LCDDATA8*8)+2;
               bit	SEG19COM2	@ ((unsigned)&LCDDATA8*8)+3;
               bit	SEG20COM2	@ ((unsigned)&LCDDATA8*8)+4;
               bit	SEG21COM2	@ ((unsigned)&LCDDATA8*8)+5;
               bit	SEG22COM2	@ ((unsigned)&LCDDATA8*8)+6;
               bit	SEG23COM2	@ ((unsigned)&LCDDATA8*8)+7;
#endif

/* Definitions for LCDDATA9 register */
               bit	SEG0COM3	@ ((unsigned)&LCDDATA9*8)+0;
               bit	SEG1COM3	@ ((unsigned)&LCDDATA9*8)+1;
               bit	SEG2COM3	@ ((unsigned)&LCDDATA9*8)+2;
               bit	SEG3COM3	@ ((unsigned)&LCDDATA9*8)+3;
               bit	SEG4COM3	@ ((unsigned)&LCDDATA9*8)+4;
               bit	SEG5COM3	@ ((unsigned)&LCDDATA9*8)+5;
               bit	SEG6COM3	@ ((unsigned)&LCDDATA9*8)+6;
               bit	SEG7COM3	@ ((unsigned)&LCDDATA9*8)+7;

/* Definitions for LCDDATA10 register */
               bit	SEG8COM3	@ ((unsigned)&LCDDATA10*8)+0;
               bit	SEG9COM3	@ ((unsigned)&LCDDATA10*8)+1;
               bit	SEG10COM3	@ ((unsigned)&LCDDATA10*8)+2;
               bit	SEG11COM3	@ ((unsigned)&LCDDATA10*8)+3;
               bit	SEG12COM3	@ ((unsigned)&LCDDATA10*8)+4;
               bit	SEG13COM3	@ ((unsigned)&LCDDATA10*8)+5;
               bit	SEG14COM3	@ ((unsigned)&LCDDATA10*8)+6;
               bit	SEG15COM3	@ ((unsigned)&LCDDATA10*8)+7;

#if defined(_16F914) || defined(_16F917)
/* Definitions for LCDDATA11 register */
               bit	SEG16COM3	@ ((unsigned)&LCDDATA11*8)+0;
               bit	SEG17COM3	@ ((unsigned)&LCDDATA11*8)+1;
               bit	SEG18COM3	@ ((unsigned)&LCDDATA11*8)+2;
               bit	SEG19COM3	@ ((unsigned)&LCDDATA11*8)+3;
               bit	SEG20COM3	@ ((unsigned)&LCDDATA11*8)+4;
               bit	SEG21COM3	@ ((unsigned)&LCDDATA11*8)+5;
               bit	SEG22COM3	@ ((unsigned)&LCDDATA11*8)+6;
               bit	SEG23COM3	@ ((unsigned)&LCDDATA11*8)+7;
#endif

/* Definitions for LCDSE0 register */
               bit	SE0		@ ((unsigned)&LCDSE0*8)+0;
               bit	SE1		@ ((unsigned)&LCDSE0*8)+1;
               bit	SE2		@ ((unsigned)&LCDSE0*8)+2;
               bit	SE3		@ ((unsigned)&LCDSE0*8)+3;
               bit	SE4		@ ((unsigned)&LCDSE0*8)+4;
               bit	SE5		@ ((unsigned)&LCDSE0*8)+5;
               bit	SE6		@ ((unsigned)&LCDSE0*8)+6;
               bit	SE7		@ ((unsigned)&LCDSE0*8)+7;

/* Definitions for LCDSE1 register */
               bit	SE8		@ ((unsigned)&LCDSE1*8)+0;
               bit	SE9		@ ((unsigned)&LCDSE1*8)+1;
               bit	SE10		@ ((unsigned)&LCDSE1*8)+2;
               bit	SE11		@ ((unsigned)&LCDSE1*8)+3;
               bit	SE12		@ ((unsigned)&LCDSE1*8)+4;
               bit	SE13		@ ((unsigned)&LCDSE1*8)+5;
               bit	SE14		@ ((unsigned)&LCDSE1*8)+6;
               bit	SE15		@ ((unsigned)&LCDSE1*8)+7;

/* Definitions for LCDSE2 register */
               bit	SE16		@ ((unsigned)&LCDSE2*8)+0;
               bit	SE17		@ ((unsigned)&LCDSE2*8)+1;
               bit	SE18		@ ((unsigned)&LCDSE2*8)+2;
               bit	SE19		@ ((unsigned)&LCDSE2*8)+3;
               bit	SE20		@ ((unsigned)&LCDSE2*8)+4;
               bit	SE21		@ ((unsigned)&LCDSE2*8)+5;
               bit	SE22		@ ((unsigned)&LCDSE2*8)+6;
               bit	SE23		@ ((unsigned)&LCDSE2*8)+7;

/* Definitions for EECON1 register */
volatile       bit	RD		@ ((unsigned)&EECON1*8)+0;
volatile       bit	WR		@ ((unsigned)&EECON1*8)+1;
volatile       bit	WREN		@ ((unsigned)&EECON1*8)+2;
volatile       bit	WRERR		@ ((unsigned)&EECON1*8)+3;
volatile       bit	EEPGD		@ ((unsigned)&EECON1*8)+7;

// Configuration Mask Definitions
#define CONFIG_ADDR	0x2007
// Oscillator 
#define EXTCLK		0x3FFF	// External RC Clockout
#define EXTIO		0x3FFE	// External RC No Clock
#define INTCLK		0x3FFD	// Internal RC Clockout
#define INTIO		0x3FFC	// Internal RC No Clock
#define EC		0x3FFB	// EC
#define HS		0x3FFA	// HS
#define XT		0x3FF9	// XT
#define LP		0x3FF8	// LP
// Watchdog Timer 
#define WDTEN		0x3FFF	// On
#define WDTDIS		0x3FF7	// Disabled / SWDTEN control
// Power Up Timer 
#define PWRTDIS		0x3FFF	// Off
#define PWRTEN		0x3FEF	// On
// Master Clear Enable 
#define MCLREN		0x3FFF	// MCLR function is enabled
#define MCLRDIS		0x3FDF	// MCLR functions as IO
// Code Protect 
#define UNPROTECT	0x3FFF	// Code is not protected
#define CP		0x3FBF	// Code is protected
#define PROTECT		CP	//alternate
// Data EE Read Protect 
#define UNPROTECT	0x3FFF	// Do not read protect EEPROM data
#define CPD		0x3F7F	// Read protect EEPROM data
// Brown Out Detect 
#define BORDIS		0x3CFF	// BOD and SBOREN disabled
#define SWBOREN		0x3DFF	// SBOREN controls BOR function (Software control)
#define BORXSLP		0x3EFF	// BOD enabled in run, disabled in sleep, SBOREN disabled
#define BOREN		0x3FFF	// BOD Enabled, SBOREN Disabled
// Internal External Switch Over Mode 
#define IESOEN		0x3FFF	// Enabled
#define IESODIS		0x3BFF	// Disabled
// Monitor Clock Fail-safe 
#define FCMEN		0x3FFF	// Enabled
#define FCMDIS		0x37FF	// Disabled
// In-Circuit Debugger Mode 
#define DEBUGEN		0x2FFF	// Enable ICD2 debugging
#define DEBUGDIS	0x3FFF	// Disable ICD2 debugging

#endif
